package com.example.busanapp.ui.home;

import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import com.example.busanapp.R;
import com.example.busanapp.home.Course_Cafe;
import com.example.busanapp.home.Course_Food;
import com.example.busanapp.home.RecyclerViewAdapterCafe;
import com.example.busanapp.home.RecyclerViewAdapterFoodCourse;

import java.util.ArrayList;
import java.util.List;

public class Course_food_cafe_Fragment extends Fragment {
    List<Course_Food> Fcourse;
    List<Course_Cafe> Ccourse;

    RecyclerView cafecardview;

    public Course_food_cafe_Fragment() {

    }


    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setHasOptionsMenu(true);

    }

    @Nullable
    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, ViewGroup container, Bundle savedInstanceState) {
        View view = inflater.inflate(R.layout.activity_all_food_trip, container, false);



        Fcourse = new ArrayList<>();
        // 1
        Fcourse.add(new Course_Food("길에서 맛보는 부산여행의 묘미", "푸디 투어",
                "착한 가격에 높은 가성비를 자랑하는 부산만의 길거리 음식, 먹거리 투어를 하기에도 손색없는 부산만의 스트리트 푸드를 만나보자.\n",

                "씨앗호떡\n" + " 부산의 길거리 음식하면 긴 줄이 가장 먼저 떠오른 원조 씨앗호떡." +
                        " 몇 차례 방송에 소개되면서 유명해진 씨앗호떡은 '부산여행하면 꼭 맛보고 싶은 먹거리' 중 빠지지 않는 음식이다." +
                        " 기름에 노릇노릇 튀겨진 호떡에 몸통 반을 갈라 고소한 견과류를 가득 넣어주는 부산만의 스타일은 타 지역에서는 전혀 맛볼 수 없는 음식이었다." +
                        " 달고 고소한 맛의 어울림이 일품인 이 호떡은 오독오독 식감까지 매력적이다.\n",

                "비빔당면\n" + " 전국을 통 틀어서 부산에만 있다는 비빔당면." +
                        " 바삐 움직이는 시장 상인이 급히 만들어 허기를 채우던 음식에서 시작했으나, 이제는 부평 깡통시장의 상징과도 같은 음식이 됐다." +
                        " 비빔당면은 여러 재료를 기름에 볶아 간장 양념하는 잡채와는 달리, 삶은 당면에 여러 고명을 얹어 새빨간 양념을 비벼 먹는 것이 특징이다." +
                        " 특별할 것 없어 보이지만 매콤한 양념에 씹히는 재료들이 어우러진 맛은 중독성이 강하다." +
                        " 시장의 키작은 의자에 삼삼오오 모여 앉아 아주머니들이 바로 해주시는 비빔당면을 후루룩 말아 먹는 경험은 부산에서만 느낄 수 있는 재미다.\n",

                "유부주머니\n" +
                        " 복주머니 형태를 가진 유부주머니는 당면과 채소로 속이 꽉 차 있는 음식이다." +
                        " 미나리나 파로 주머니를 감싼 모양이 제법 먹음직스럽다. 보통 어묵과 곁들여 유부주머니전골로 즐기는데," +
                        " 유부주머니를 터트리기 전 맑은 국믈을 먼저 맛보고, 터뜨린 후 당면과 채소가 어우러진 고소한 국물을 즐기면 두 가지 맛을 한 번에 느낄 수 있다.\n",

                "오징어무침&정구지 지짐(부추전)\n" +
                        " 오징어무침을 길거리에서 먹는다니 조금 낯설기도 하다." +
                        " 그러나 남포동 골목에서 서서 먹는 오징어무침과 정구지 지짐을 한 번 맛보면 그 맛의 매력을 쉽게 잊을 수 없다." +
                        " 매콤 새콤한 오징어무침과 넓은 철판에 바삭하게 구워낸 정구지 지짐의 궁합은 가히 최고라 할 수 있다." +
                        " 기름에 고소하게 구운 만두와 세트로 먹는 것도 괜찮은 조합이다.\n",

                "부평시장 떡볶이·오뎅\n" +
                        " 부평 깡통시장에는 많은 떡볶이 집들이 있다." +
                        " 매체에 소개되면서 유명세를 탄 떡볶이부터 오랜 시간동안 자리를 지켜온 분식집까지." +
                        " 부평시장에 가면 부산 떡볶이 특유의 맛을 제대로 느낄 수 있다." +
                        " 이곳의 떡볶이 떡은 주로 두꺼운 가래떡을 사용해 쫀득한 식감이 특징인데, 가래떡을 어묵처럼 꼬치에 꽂아 먹는 물떡도 부산·경상도만의 스타일이다." +
                        " 일제강점기를 지나며 다양한 맛의 어묵을 생산하기 시작한 것도 부산이 가장 먼저다.\n",

                " 이 외에도 겨울에는 단팥죽, 여름에는 팥빙수를 포함, 오며가며 손이 가는 회오리 감자칩 등도 길거리에서 즐길 수 있는 부산의 맛이다." +
                        "\n\n" + " 맛은 기본, 상인들의 넉넉한 인심까지 느낄 수 있는 부산 길거리 음식." +
                        " 마음까지 든든하게 채우고 싶은 여행자라면 빨리 부산으로 떠나자.",

                R.drawable.street_1, R.drawable.street_2, R.drawable.street_3, R.drawable.street_4,
                R.drawable.street_5, R.drawable.street_6, R.drawable.street_7));

        // 2
        Fcourse.add(new Course_Food("맛의 핫플! 초량 돼지갈비 골목 & 불백 거리", "푸디 투어",
                " 초량 돼지갈비 골목과 초량 불백(불고기 백반) 거리는 부산의 많은 먹자골목 가운데서도 유독 남녀노소 모두의 사랑을 독차지하는 곳이다.\n",

                " 초량돼지갈비 골목의 시작은 6·25전쟁으로 거슬러 올라간다." +
                        " 당시 부산에는 많은 피난민이 몰려들었다." +
                        " 초량동은 피난민 거주지와 도심을 연결하는 가운데쯤이었는데 이때부터 값싼 돼지갈비 집이 하나둘 들어서게 된다." +
                        " 그러다 미국의 원조 용품이 들어오고 부산항 등에서 일하는 노동자가 급증하면서 1950년대 후반부터 상권이 형성된다." +
                        " 게다가 초량동 인근 산복도로에 노동자들이 터전을 잡자 이때부터 돼지갈비 골목으로 본격 이름이 난다.\n",

                " 30년 넘게 골목을 가득 채우던 고기 굽던 연기는 1990년대 부산항의 기능 이전과 자동화 등이 겹치며 시들해져 갔다." +
                        " 사람이 없으니 상권도 차츰 힘을 잃어 간 것." +
                        " 이때부터 돼지갈비 골목의 주 고객이 차츰 가족단위 지역주민으로 변해 간다." +
                        " 그러던 중 국내 여행 활성화 등이 맞물리며 이제는 어느덧 부산 대표 먹자골목으로 한축을 담당하고 있다.\n",

                " 40년 넘게 한 자리를 지켜온 전통 있는 가게에서 뿜어내는 달짝지근한 돼지갈비 냄새에 이끌려 자리를 잡으면 주인장의 음식솜씨를 가늠해 볼 수 있는 밑반찬이 먼저 오른다." +
                        " 신선한 샐러드는 허기진 빈속을 달래주고 돼지갈비와 찰떡궁합을 자랑하는 백김치는 없으면 서운하다." +
                        " 고춧가루와 참기름으로 버무린 깔끔한 파채는 특유의 생생한 자태를 뽐낸다." +
                        " 숯불에 달궈진 석쇠 위에 돼지갈비를 올리면 지글거리는 소리가 침샘을 자극하고 연기를 타고 풍기는 불향이 입맛을 다시게 한다.\n",

                " 돼지갈비 골목 인근에는 초량 불백 거리다." +
                        " 일명 육(肉)거리라 불리는 이곳은 최고의 가성비로 이름난 곳이다." +
                        " 이 골목 불백은 택시기사들 사이에서 먼저 입소문이 나기 시작했다." +
                        " 사실 기사식당이란 간판을 달고 있는 집은 예전부터 싸고 맛있는 집이 많았다." +
                        " 부산 초량 불백 거리도 비싼 돈 들이지 않고 맛 좋은 불고기에 쌈을 즐길 수 있었으니 택시기사들 사이에서 인기 만점인 장소였다.\n",

                " 그랬던 불백 거리가 이제는 전국적 맛집 골목으로 알려지면서 여행자들이 제법 찾는 장소가 됐다.\n" +
                        " 불향 가득 입혀진 간장, 고추장 불고기에 어우러진 밑반찬, 거기에 갓 지은 고슬고슬한 쌀밥은 몇 십 년을 이어오는 불백 거리의 힘이다." +
                        " 젊은이들의 입맛을 저격한 치즈 불백과 같은 신메뉴 뿐만 아니라 오리불고기, 순두부찌개, 돌솥비빔밥 등 다양한 메뉴를 함께 즐길 수 있는 것도 이 골목의 장점이다.\n",

                " 불백 거리의 모든 가게가 저마다 원조를 자처하지만 고민을 길게 할 필요는 없다." +
                        " 대부분의 가게들이 기본 이상의 맛과 착한 가격을 보장하니 말이다.\n\n" +
                        " 어머니의 손맛을 느낄 수 있는 든든한 불고기백반, 남다른 감칠맛 자랑하는 돼지갈비까지." +
                        " 부산에서 고기 맛을 제대로 느끼고 싶다면 일단 초량으로 가보자.\n",

                R.drawable.fork_1, R.drawable.fork_2, R.drawable.fork_3, R.drawable.fork_4, R.drawable.fork_5, R.drawable.fork_6, R.drawable.fork_7));

        //3
        Fcourse.add(new Course_Food("낭만 추억 만들어 주는 해운대 포장마차", "푸디 투어",
                " 해운대 해변을 따라 줄지어 자리한 포장마차가 눈에 들어온다." +
                        " 저녁이 되면 거대한 마천루 아래 알록달록 불을 밝히는 해운대 포장마차는 그 분위기마저 낭만적이다.\n",
                " 포차마다 구비된 수조에는 전복, 개불, 멍게, 소라 등 내로라하는 부산의 해산물들이 가득 담겨있다." +
                        " 실제 해수를 사용해 신선도를 유지하니 해산물의 바다맛이 고스란히 전달된다.\n",
                " 해운대 포장마차촌은 미식여행의 색다른 재미를 선사하는 곳이자, 투박하지만 정겨운 부산 사람의 인심을 담을 수 있는 곳이기도 하다.\n",
                "", "", "", "",
                R.drawable.snackcart_1, R.drawable.snackcart_2, R.drawable.snackcart_3, 0, 0, 0, 0));

        cafecardview = view.findViewById(R.id.recycler_cafe);
        cafecardview();

        RecyclerView myrv = view.findViewById(R.id.recycler_food);
        RecyclerView.Adapter myAdapter = new RecyclerViewAdapterFoodCourse(getActivity(), Fcourse);

        // 가로 레이아웃
        LinearLayoutManager horizontalLayoutManager = new LinearLayoutManager(getActivity(), RecyclerView.HORIZONTAL, false);

        // 레이아웃 매니저 연결
        myrv.setLayoutManager(horizontalLayoutManager);

        myrv.setAdapter(myAdapter);

        return view;
    }


    private void cafecardview(){


        Ccourse = new ArrayList<>();

        // 1
        Ccourse.add(new Course_Cafe("부산 낭만카페 35선 1편", "카페 투어",
                " 로맨틱한 도시 부산이 알려주는 낭만 가득한 카페 35선." +
                        " 본격적으로 카페투어에 나서보고자 하는 카페러버에게 필수 정보 되겠다." +
                        " 지역별로 묶은 부산 낭만카페35선 제 1탄을 시작한다.\n",

                "# 중구지역\n\n" +
                        "레귤러하우스\n\n" +
                        " 남포동 국제시장 내부에 위치한 ‘레귤러하우스’는 재즈 음악과 빈티지가 잘 어우러진 카페이다." +
                        " 고풍스러우면서도 고급진 소품들과 빈티지한 인테리어가 특징인 이곳은 커피뿐만 아니라 차와 디저트의 종류가 다양해 골라 먹는 재미가 있는 곳이다.\n",

                "노티스1950\n\n" +
                        " 중앙동에 위치한 노티스1950은 1950년대 쌀 창고로 이용되었던 건물을 리모델링하여 복합문화공간으로 재탄생시켰다." +
                        " 창가에 앉아 부산항의 전망을 즐길 수 있는 것이 특징인 이곳은 드라마 ‘쌈, 마이웨이’를 비롯해 영화, 드라마, 광고 촬영지로도 유명하다.\n",

                "바우노바 백산점\n\n" +
                        " 남포동과 중앙동 사이쯤 위치하고 있는 ‘바우노바 백산점’은 일본식 목조건물을 개조한 조용하고 안락한 카페이다. 이곳에선 커피를 테이크아웃 할 수 없다." +
                        " 핸드드립 커피를 고집하는 만큼이나 천천히, 그리고 충분히 커피 맛을 음미할 수 있는 진정한 공간이 되기를 바라는 주인장의 마음일 것이다.\n",

                "\n# 서구지역\n\n" +
                        "TCC\n\n" +
                        " 암남동 ‘TCC’ 카페는 송도해수욕장을 한 눈에 담을 수 있는 곳에 자리하고 있다." +
                        " 가장 인기 있는 장소는 탁 트인 송도 앞 바다를 볼 수 있는 루프탑이다." +
                        " 통유리로 만들어진 창은 바다 전망을 즐길 수 있고, 화사한 실내에 분위기를 더한다." +
                        " 주변에는 송도해상케이블카와 시티투어버스 정류소가 있다.\n",

                "빈스톡\n\n" +
                        " 송도에는 부산 3대 커피장인이 운영하는 카페로 유명한 빈스톡이 있다." +
                        " 원두의 풍부한 향을 느끼고 싶다면 다크 로스트로 유명한 커피장인이 빚어내는 핸드드립 커피를 맛 볼 수 있는 빈스톡을 추천 한다.\n",

                "\n# 동구지역\n\n" +
                        "카페 초량1941\n\n" +
                        " 초량동 산복도로에 위치하고 있는 ‘초량1941’은 1941년 지어진 일본식 가옥을 개조해 만든 카페이다. 다양한 종류의 우유카페로 유명한 이곳은 숲의 신선한 공기를 마시며 자연을 느낄 수 있다." +
                        " 우유뿐만 아니라 다양한 굿즈도 판매한다.\n",

                "문화공감 수정\n\n" +
                        " 도시철도 부산진역 근처에 위지하고 있는 ‘문화공감수정’은 일본식 전통가옥의 느낌을 그대로 살려 카페로 운영되고 있다." +
                        " 입구를 지나 가옥을 보고 있으면 마치 일본의 어느 집에 들어온 듯한 착각을 불러일으킨다." +
                        " 일본식 가옥이지만 한국 전통차를 맛볼 수 있다." +
                        " 아이유의 ‘밤 편지’ 뮤직비디오 촬영지로도 유명하다.\n",

                "\n# 남구지역\n\n" +
                        "딜라잇식스\n\n" +
                        " 대연동에 위치한 ‘딜라잇식스’는 도심형 카페이다." +
                        " 각 공간마다 테마가 있어 찾는 사람들에게 다양한 볼거리를 제공한다." +
                        " 본관과 별관으로 구분되어 있고 공간이 넓어, 원하는 공간에서 커피를 즐길 수 있다." +
                        " 주변을 둘러보면 사진을 찍을 수 있는 포토존도 쉽게 찾아볼 수 있다.\n",

                "카페 이정원\n\n" +
                        " 경성대 대학가에 위치한 ‘카페 이정원’은 카페 이름처럼 식물을 활용한 정원 인테리어가 독창적이다." +
                        " 정원이 한눈에 들어오는 통 창 가득 햇살이 쏟아지는 이곳은 다양한 커피를 비롯해 10여 가지 종류의 베이커리 메뉴로도 유명하다.\n",

                R.drawable.cafe1_1, R.drawable.cafe1_2, R.drawable.cafe1_3, R.drawable.cafe1_4, R.drawable.cafe1_5,
                R.drawable.cafe1_6, R.drawable.cafe1_7, R.drawable.cafe1_8, R.drawable.cafe1_9, R.drawable.cafe1_10));

        // 2
        Ccourse.add(new Course_Cafe("부산 낭만카페 35선 2편", "카페 투어",
                " 로맨틱한 도시 부산이 알려주는 낭만 가득한 카페 35선." +
                        " 본격적으로 카페투어에 나서보고자 하는 카페러버에게 필수 정보 되겠다." +
                        " 지역별로 묶은 부산 낭만카페35선 제 2탄!\n",

                "# 영도구지역\n\n" +
                        "카린 영도플레이스\n\n" +
                        " 선글라스 브랜드로 유명한 ‘카린’은 청학동에 카페 ‘카린 영도플레이스’를 운영하고 있다." +
                        " 넓은 주차장과 루프탑이 있어 탁 트인 시원한 영도 바다 전망을 즐길 수 있다." +
                        " 북유럽 스타일의 인테리어로 쾌적하고 깔끔한 분위기를 느낄 수 있으며, 카린 선글라스 쇼룸이 있어 다양한 선글라스를 직접 써볼 수도 있다.\n",

                "신기산업\n\n" +
                        " 사무용품 제조회사인 신기산업은 회사의 사옥을 카페로 운영하고 있다." +
                        " 바다뷰 카페투어의 성지가 이곳에서부터 시작되었다고 할 수 있다." +
                        " 내부는 화이트와 그레이톤으로 꾸며져 있어 차분한 분위기를 느낄 수 있다." +
                        " 부산항대교와 영도 일대를 바라볼 수 있으며, 밤에는 멋진 야경도 즐길 수 있다.\n",

                "젬스톤\n\n" +
                        " 수영장 안에서 커피를 마신다면 어떤 기분일까." +
                        " 카페 젬스톤은 수영장이었던 건물의 인테리어를 그대로 살려 카페로 탈바꿈시켰다." +
                        " 카페 곳곳이 다양한 테마로 꾸며져 있어 사진을 찍거나 구경하는 재미가 쏠쏠하다." +
                        " 어떤 카페에서도 느낄 수 없는 독특한 분위기를 즐길 수 있는 곳이다.\n",

                "\n# 부산진구지역\n\n" +
                        "빈티지38\n\n" +
                        " 아늑한 공간에서 여유로운 시간을 보내고 싶다면 전포카페거리에 위치한 카페 ‘빈티지38’을 추천한다." +
                        " 빈티지한 느낌을 물씬 풍기는 외관과는 달리 내부는 현대적인 감각으로 꾸며져 있다." +
                        " 직접 로스팅한 커피와 베테랑 파티쉐의 베이커리를 24시간 맛볼 수 있는 곳.\n",

                "비포선셋\n\n" +
                        " 유럽풍의 인테리어와 이국적인 분위기를 원한다면 ‘비포선셋’은 어떨까." +
                        " 다양한 식물을 활용한 인테리어는 싱그럽고 편안한 분위기를 만들어 준다." +
                        " 이곳은 국내 여행자들뿐만 아니라 SNS를 통해서 입소문을 타고 온 일본·중국·대만 등의 외국인들이 자주 방문하는 곳이다.\n",

                "오월생\n\n" +
                        " 사장님이 직접 만든 수제 디저트로 유명한 카페 ‘오월생’은 화이트로 꾸며진 인테리어가 특징인 곳이다." +
                        " 화사하고 밝은 분위기와 주인장의 감성 있는 인테리어 소품들이 조화를 이뤄 많은 사람들이 사진을 찍기 위해 찾아오는 카페이기도 하다.\n",

                "유월커피\n\n" +
                        " 6월과 your을 모두 담고 있는 카페 ‘유월커피’는 전포 카페거리 터줏대감이다." +
                        " 작고 오래된 외관의 건물이지만 안으로 들어가면 아늑하고 포근한 분위기를 느낄 수 있다." +
                        " 맛있는 커피와 함께 특유의 차분한 분위기를 즐기기에 안성맞춤.\n",

                "\n# 해운대지역\n\n" +
                        "엣지993\n\n" +
                        " 해운대해수욕장 근처에 위치한 ‘엣지993’은 바다 전망이 좋기로 유명하다." +
                        " 1, 5, 6층이 카페로 운영되고 모든 테이블이 바다를 향하고 있다." +
                        " 6층 루프탑에서 바다를 바라보면 해운대 백사장과 좌우로 펼쳐지는 광안대교, 마린시티, 동백섬 등 부산의 랜드마크를 한눈에 볼 수 있다.\n",

                "포트1902\n\n" +
                        " 송정해수욕장과 멀지 않은 곳에 위치하고 있는 ‘포트1902’은 커피뿐만 아니라 전시, 공연, 파티 등 다양한 목적의 공간으로 운영되는 곳이다." +
                        " 국내 최초로 풀장을 보유한 카페로도 알려져 있고, 층별로 색다른 인테리어를 선보인다.\n",

                R.drawable.cafe2_1, R.drawable.cafe2_2, R.drawable.cafe2_3, R.drawable.cafe2_4, R.drawable.cafe2_5,
                R.drawable.cafe2_6, R.drawable.cafe2_7, R.drawable.cafe2_8, R.drawable.cafe2_9, R.drawable.cafe2_10));

        //3
        Ccourse.add(new Course_Cafe("부산 낭만카페 35선 3편", "카페 투어",
                " 로맨틱한 도시 부산이 알려주는 낭만 가득한 카페 35선." +
                        " 본격적으로 카페투어에 나서보고자 하는 카페러버에게 필수 정보 되겠다." +
                        " 지역별로 묶은 부산 낭만카페35선 제 3탄!\n" +
                        " 저녁이 되면 거대한 마천루 아래 알록달록 불을 밝히는 해운대 포장마차는 그 분위기마저 낭만적이다.\n",

                "# 동래구지역\n\n" +
                        "아트케이갤러리 카페\n\n" +
                        " 아름다운 정원과 멋지게 어우러진 외관이 눈길을 사로잡는 아트케이갤러리." +
                        " 아트홀, 정원카페, 갤러리카페로 이루어져 있다." +
                        " 구 수가화랑을 복합문화공간으로 재탄생 시킨 이곳에서는 다양한 문화 행사가 열리며, 카페 곳곳에서 다양한 예술작품을 감상 할 수 있다.\n",

                "그린내\n\n" +
                        " 동래 복천동 고분으로 가는 한적한 길에 위치한 ‘그린내’는 직접 만든 커피와 빵으로 유명한 곳이다." +
                        " 로스팅을 배울 수 있는 교육 프로그램을 진행하고 있으며, 탁 트인 고분일대의 전망을 볼 수 있는 공간과 천장 위로 하늘을 볼 수 있는 다락방이 있다.\n",

                "어반플로우\n\n" +
                        " 벚꽃 명소로 알려진 온천천 카페거리에 위치한 ‘어반플로우’는 모던 화이트톤으로 꾸며져 트렌디한 분위기를 느낄 수 있다." +
                        " 밝은 인테리어 덕에 카페 안에서도 멋진 사진들을 담을 수 있는 곳이다." +
                        " 전문 바리스타가 운영하고 있으며 수플레 팬케이크가 맛있기로 유명하다.\n",

                "\n# 북구지역\n\n" +
                        "루왁\n\n" +
                        " 도심 속에서 이색적인 분위기를 찾고 싶다면 카페 ‘루왁’을 추천한다." +
                        " 금곡동 부산인도네시아센터 1층에 자리하고 있는 이곳은 인도네시아 전통 기념품들과 특산품 코너도 따로 마련되어 있다." +
                        " 한국 속 작은 인도네시아를 느끼며 커피 한 잔의 여유를 즐기고 싶은 이들에게 알맞은 장소.\n",

                "\n# 사상구지역\n\n" +
                        "Vsant\n\n" +
                        " 낙동강 강변대로의 전망을 즐길 수 있는 ‘Vsant.’" +
                        " 해질 무렵 방문한다면 운치 있는 노을을 마주하며 커피를 즐길 수 있는 곳이다." +
                        " 중후하면서도 럭셔리한 내부 인테리어는 커피의 진한 맛을 더해준다." +
                        " 3층 루프탑에 오르면 곳곳에 선셋 포인트와 포토존이 준비되어 있다.\n",

                "\n# 기장군지역\n\n" +
                        "웨이브온\n\n" +
                        " 기장바다를 바라보는 오션뷰가 유명한 카페 ‘웨이브온’은 한국건축문화대상에 입상 할 만큼 건물의 외관이 인상적이다." +
                        " 루프 탑, 통유리 등 카페 내부에서도 오션뷰를 즐길 수 있도록 꾸며졌다." +
                        " 특히, 루프탑에서 즐기는 바다 풍경이 그림처럼 아름다운 곳이다.\n",

                "아데초이\n\n" +
                        " 깔끔한 화이트풍의 외관과는 달리, 앤티크 한 내부 소품과 원색의 대비가 이국적인 카페 아데초이." +
                        " 원목으로 만든 테이블과 늘어진 샹들리에가 묘한 조화를 이루는 곳이다." +
                        " 티타임 후 한적한 해안마을을 산책할 수 있는 멋진 곳에 위치한다.\n",

                "헤이든\n\n" +
                        " 작은 공원과 함께 자리하고 있는 바다 앞 카페 ‘헤이든’은 가벼운 산책을 즐기며 들르기 좋은 곳이다." +
                        " 카페 안에 위치한 테이블 뿐 아니라 외부에도 커피를 마시며 경치를 구경 할 수 있도록 다양한 위치에 테이블을 마련해 두었다." +
                        " 덕분에 기장 앞바다가 한눈에 들어오는 풍경을 즐길 수 있다.\n",

                "비치다카페\n\n" +
                        " 주택을 리모델링한 ‘비치다카페’는 3개의 건물 동과 아이들도 뛰어 놀 수 있을 만큼 넓은 정원이 특징이다." +
                        " 각 동마다 루프탑이 있어 시원한 바다 바람과 함께 푸른 하늘을 감상할 수 있다." +
                        " 가장 높은 루프탑에선 기장 바다풍경과 더불어 빨강, 하양 방파제를 눈에 담을 수 있다.\n",

                R.drawable.cafe3_1, R.drawable.cafe3_2, R.drawable.cafe3_3, R.drawable.cafe3_4, R.drawable.cafe3_5,
                R.drawable.cafe3_6, R.drawable.cafe3_7, R.drawable.cafe3_8, R.drawable.cafe3_9, R.drawable.cafe3_10));

        // 4
        Ccourse.add(new Course_Cafe("부산 낭만카페 35선 4편", "카페 투어",
                " 로맨틱한 도시 부산이 알려주는 낭만 가득한 카페 35선." +
                        " 본격적으로 카페투어에 나서보고자 하는 카페러버에게 필수 정보 되겠다." +
                        " 지역별로 묶은 부산 낭만카페35선 마지막 4탄!\n",

                "# 사하구지역\n\n" +
                        "소울레터커피컴퍼니\n\n" +
                        " 신평동에 있는 ‘소울레터커피컴퍼니’는 식물이 있는 공간이라는 콘셉트를 가진 깔끔한 카페이다." +
                        " 흰색 벽돌 내부 벽면과 카페 안을 채우고 있는 초록식물들이 편안하고 아늑한 공간을 만들어준다." +
                        " 소울 시그니처 커피가 인기 메뉴이고 호주식 디저트 파블로바도 인기다.\n",

                "\n# 금정구지역\n\n" +
                        "모모스\n\n" +
                        " 도심 속 정원 인테리어로 유명한 부곡동 ‘모모스커피’는 부산 커피의 대명사로 불릴 만큼 명성이 자자한 곳이다." +
                        " 전국의 커피 마니아들이 모여드는 이곳은 핸드드립 커피와 스페셜 티가 유명하다." +
                        " 계절별로 농장과 협약하여 들여오는 주스메뉴도 인기가 높다." +
                        " 커피뿐만 아니라 원두와 다양한 굿즈도 판매하는 커피 회사이기도 하다.\n",

                "티원\n\n" +
                        " 부산카페하면 오션뷰가 멋진 카페들을 먼저 떠올리겠지만 마운틴뷰로 유명한 카페도 있다." +
                        " ‘티원’은 범어사 인근 숲속에 자리하여 자연이 주는 맑은 공기를 마시며 힐링 할 수 있는 곳이다." +
                        " 상쾌한 허브차 한잔이면 마음 속 까지 깨끗해지는 기분이 든다." +
                        " 생각을 정리하면서 여유를 즐기기에 안성맞춤인 카페이다.\n",

                "\n# 강서구지역\n\n" +
                        "포레스트3002\n\n" +
                        "사랑스러운 반려견과 함께 카페를 방문하고자 한다면 강서구 녹산동 ‘포레스트3002’를 추천한다.주말에 반려견과 함께 입장이 가능하며, 반려견들이 뛰어놀 수 있는 넓은 정원과 낙동강 뷰를 즐길 수 있다는 것이 이 카페만의 매력이다." +
                        " 주인장이 마련한 감각적인 볼거리를 보는 재미도 쏠쏠하다.\n",

                "몽도르카페\n\n" +
                        " 가덕도 앞바다에 앉아 일몰과 일출을 감상할 수 있는 카페가 있다." +
                        " 천성동 ‘몽도르카페’는 가덕도 해안 끝자락에 위치해 눈앞에 펼쳐진 바다가 손에 닿을 듯 가깝다." +
                        " 탁 트인 널찍한 야외테라스와 숨어 있는 듯 아늑한 숲속 테라스가 있다." +
                        " 작은 오솔길을 따라 계단으로 내려가면 몽돌이 깔린 해안에서 산책을 즐길 수 있다.\n",

                "\n# 연제구지역\n\n" +
                        "고래커피\n\n" +
                        " 다양한 소품들과 빈티지한 감성을 느낄 수 있는 연산동 ‘고래커피.’" +
                        " SNS에서도 높은 인기를 자랑하는 이곳은 마치 공사장에 온 것 같은 느낌의 인테리어가 시그니처다." +
                        " 직접 로스팅한 커피를 판매하고 있으며, 원당 밀크커피와 흑당 구름 커피가 유명하다.\n",

                "\n# 수영구지역\n\n" +
                        "오후의홍차\n\n" +
                        " 홍차를 즐기는 사람을 위한 맞춤카페 ‘오후의홍차.’" +
                        " 홍차를 비롯해 블랜디드티, 백차, 녹차 등 다양한 차를 음미할 수 있다." +
                        " 부산다운건축상을 받을 만큼 외관이 아름답고 내부 또한 고풍스럽다." +
                        " 5층 루프탑에서는 수영강변과 강 건너편에 있는 마린시티, 센텀시티를 조망할 수 있다." +
                        " 1층과 2층의 갤러리에서는 상설이나 기획전시가 열린다.\n",

                "더박스\n\n" +
                        " 수영 강변 야경이 아름다운 민락동 ‘더박스’는 아름다운 외관으로 각종 건축상에서 입상한 카페이다." +
                        " 커다란 박스가 어긋나게 얹어진 외형이 인상적인 이곳은 외관만으로도 방문자들의 마음을 설레게 한다." +
                        " 테라스에서 바라보는 바다 풍경은 마치 크루즈여행을 하고 있는 듯한 즐거움을 선사한다.\n",

                " ",

                R.drawable.cafe4_1, R.drawable.cafe4_2, R.drawable.cafe4_3, R.drawable.cafe4_4, R.drawable.cafe4_5,
                R.drawable.cafe4_6, R.drawable.cafe4_7, R.drawable.cafe4_8, R.drawable.cafe4_9, 0));


        RecyclerView.Adapter myAdapter = new RecyclerViewAdapterCafe(getActivity(), Ccourse);

        // 가로 레이아웃
        LinearLayoutManager horizontalLayoutManager = new LinearLayoutManager(getActivity(), RecyclerView.HORIZONTAL, false);

        // 레이아웃 매니저 연결
        cafecardview.setLayoutManager(horizontalLayoutManager);

        cafecardview.setAdapter(myAdapter);
    }

}
